tests/artillery/carga-alta.yml
config:
  target: "https://seedor-1.vercel.app"
  phases:
    - duration: 30
      arrivalRate: 3
      name: "Calentamiento - 3 usuarios por segundo"
    - duration: 60
      arrivalRate: 8
      rampTo: 15
      name: "Incremento - 8 a 15 usuarios por segundo"
    - duration: 120
      arrivalRate: 15
      name: "Carga alta - 15 usuarios por segundo"
    - duration: 30
      arrivalRate: 15
      rampTo: 5
      name: "Reducción - 15 a 5 usuarios por segundo"
  processor: "./processor.js"
  plugins:
    metrics-by-endpoint: {}
    expect: {}

scenarios:
  - name: "Usuario básico - Solo login y navegación"
    weight: 5
    flow:
      # Iniciar sesión
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $processEnvironment.EMAIL_TEST }}"
            password: "{{ $processEnvironment.PASSWORD_TEST }}"
          expect:
            - statusCode: 200
          afterResponse: "extractAuthToken"
      
      # Visitar la página principal
      - get:
          url: "/home"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
      
      # Navegar a una sola sección
      - get:
          url: "/campo"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 3
      
      # Cerrar sesión
      - get:
          url: "/api/auth/logout"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200

  - name: "Usuario de Campo - Enfocado en operaciones de campo"
    weight: 3
    flow:
      # Iniciar sesión
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $processEnvironment.EMAIL_TEST }}"
            password: "{{ $processEnvironment.PASSWORD_TEST }}"
          expect:
            - statusCode: 200
          afterResponse: "extractAuthToken"
      
      # Generar datos aleatorios
      - function: "generateRandomData"
      
      # Visitar el módulo de Campo
      - get:
          url: "/campo"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
      
      # Visitar la página de creación de campo
      - get:
          url: "/crear-campo"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 3
      
      # Volver al listado de campos
      - get:
          url: "/campo"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
      
      # Cerrar sesión
      - get:
          url: "/api/auth/logout"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200

  - name: "Usuario de Empaque - Enfocado en operaciones de empaque"
    weight: 3
    flow:
      # Iniciar sesión
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $processEnvironment.EMAIL_TEST }}"
            password: "{{ $processEnvironment.PASSWORD_TEST }}"
          expect:
            - statusCode: 200
          afterResponse: "extractAuthToken"
      
      # Visitar el módulo de Empaque
      - get:
          url: "/empaque"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 1
      
      # Visitar la sección de Ingreso de Fruta
      - get:
          url: "/empaque/ingreso-fruta"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
      
      # Visitar la sección de Preproceso
      - get:
          url: "/empaque/preproceso"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
      
      # Visitar la sección de Pallets
      - get:
          url: "/empaque/pallets"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
      
      # Cerrar sesión
      - get:
          url: "/api/auth/logout"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200

  - name: "Administrador - Recorre todas las secciones"
    weight: 1
    flow:
      # Iniciar sesión
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $processEnvironment.EMAIL_TEST }}"
            password: "{{ $processEnvironment.PASSWORD_TEST }}"
          expect:
            - statusCode: 200
          afterResponse: "extractAuthToken"
      
      # Visitar la página principal
      - get:
          url: "/home"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 1
      
      # Visitar el módulo de Campo
      - get:
          url: "/campo"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 1
      
      # Visitar el módulo de Empaque
      - get:
          url: "/empaque"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 1
      
      # Visitar la sección de Preproceso
      - get:
          url: "/empaque/preproceso"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 1
      
      # Visitar Finanzas
      - get:
          url: "/finanzas"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 1
      
      # Visitar Trabajadores
      - get:
          url: "/trabajadores"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 1
      
      # Visitar Usuarios
      - get:
          url: "/usuarios"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 1
      
      # Visitar Ajustes
      - get:
          url: "/ajustes"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 1
      
      # Cerrar sesión
      - get:
          url: "/api/auth/logout"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200