tests/artillery/navegacion-basica.yml
config:
  target: "https://seedor-1.vercel.app"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Calentamiento - 1 usuario por segundo"
    - duration: 120
      arrivalRate: 2
      name: "Carga baja - 2 usuarios por segundo"
  processor: "./processor.js"
  plugins:
    metrics-by-endpoint: {}
    expect: {}

scenarios:
  - name: "Flujo de navegación básica"
    flow:
      # Visitar la página de login
      - get:
          url: "/login"
          expect:
            - statusCode: 200
      
      # Proceso de login
      - post:
          url: "/api/auth/login"
          json:
            email: "demo@seedor.com"
            password: "demo123"
            remember: true
          expect:
            - statusCode: 200
          afterResponse: "extractAuthToken"
          
      # Visitar la página principal
      - get:
          url: "/home"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
          afterResponse: "logResponse"
      
      # Navegar al módulo de Campo
      - get:
          url: "/campo"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 3
          afterResponse: "logResponse"
      
      # Navegar al módulo de Empaque
      - get:
          url: "/empaque"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
          afterResponse: "logResponse"
      
      # Visitar secciones de Empaque
      - get:
          url: "/empaque/ingreso-fruta"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
          afterResponse: "logResponse"
      
      - get:
          url: "/empaque/preproceso"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          think: 2
          afterResponse: "logResponse"
      
      # Cerrar sesión
      - post:
          url: "/api/auth/logout"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
          afterResponse: "logResponse"
      
      # Visitar la página principal
      - get:
          url: "/home"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: [200, 302, 401]
          think: 2
          afterResponse: "logResponse"
      
      # Navegar al módulo de Campo
      - get:
          url: "/campo"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: [200, 302, 401]
          think: 3
          afterResponse: "logResponse"
      
      # Navegar al módulo de Empaque
      - get:
          url: "/empaque"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: [200, 302, 401]
          think: 2
          afterResponse: "logResponse"
      
      # Visitar secciones de Empaque
      - get:
          url: "/empaque/ingreso-fruta"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: [200, 302, 401]
          think: 2
          afterResponse: "logResponse"
      
      - get:
          url: "/empaque/preproceso"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: [200, 302, 401]
          think: 2
          afterResponse: "logResponse"
      
      # Cerrar sesión
      - post:
          url: "/api/auth/logout"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: [200, 302, 401, 404]
          afterResponse: "logResponse"